# Даны списки:
# a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89];
# b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13].
# Нужно вернуть список, который состоит из элементов, общих для этих двух списков.
a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
result = list(filter(lambda elem: elem in b, a)) #функцией filter
print(result)

# 2 вариант

result = [elem for elem in a if elem in b] # списковым включением
print(result)

# 3 вариант

result = list(set(a) & set(b)) #привести оба списка к множествам и найти их пересечение
print(result)